//Зелень 27.03.22.
// Задание 1 
//Найти и вывести остаток от деления целого числа на 4, не выполняя деления
//и не используя операцию взятия остатка от деления.
//Задание 2 
//Структура содержит информацию о животных зоопарка : количество особей
//(число), название(указатель), вложенную структуру – дату поступления в
//зоопарк(строка фиксированной длины) и среднюю продолжительность
//жизни.Найти животных с заданным названием.Удалить животных с
//заданным количеством особей.

#include <stdio.h>
#include <locale.h>
#include "functions.h"


int main() {
    setlocale(LC_ALL, "Rus");
    while (1) {
        int num_animals = 0;
        int choice = 0;
        int num = 0;
        printf("Меню:\n");
        printf("Введите 1 для выполнения первого задания.\n");
        printf("Введите 2 для выполнения второго задания.\n");
        printf("Для выхода введите '0'.\n");
        scanf_s("%d", &choice);

        if (choice == 0) {
            printf("Выход из программы.\n");
            break;
        }
        

        switch (choice) {
        case 1:                       
            findRemainderBy4(num);
            break;
        case 2:         
            ZooStructure(num_animals);
            break;
        default:
            printf("Ошибка: выберите 1, 2 или 0 для выхода.\n");
        }       
    }
    
    return 0;
}

